# Desribes and testing of functions for data processing

In [103]:
import pandas as pd
import numpy as np

%load_ext autoreload
%autoreload 2

from data_processing import *

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [3]:
test_df = pd.DataFrame({
    "num_var" : np.random.normal(3, 5, 200),
    "cut_var" : np.random.choice(['a', 'b'])
})

# `insert_next`

Quick insertion following the column selected by name for pandas.DataFrame.

In [4]:
test_df = pd.DataFrame({
    "num_var" : np.random.normal(3, 5, 200),
    "cut_var" : np.random.choice(['a', 'b'])
})

## *One level columns*

Rely simple to use

In [5]:
insert_next(test_df, "num_var", test_df["num_var"] / 20)

test_df

      num_var cut_var
0    6.204618       b
1   -0.668044       b
2   -1.732069       b
3    7.828380       b
4    1.906720       b
..        ...     ...
195 -0.171697       b
196  9.251502       b
197  9.580987       b
198 -5.414385       b
199  0.514817       b

[200 rows x 2 columns]

In [6]:
insert_next(test_df, "num_var", test_df["num_var"]*20)

      num_var  num_var_transf cut_var
0    6.204618      124.092356       b
1   -0.668044      -13.360878       b
2   -1.732069      -34.641370       b
3    7.828380      156.567608       b
4    1.906720       38.134402       b
..        ...             ...     ...
195 -0.171697       -3.433946       b
196  9.251502      185.030050       b
197  9.580987      191.619744       b
198 -5.414385     -108.287707       b
199  0.514817       10.296346       b

[200 rows x 3 columns]

## *Multi level columns*

Have some details in using.

In [7]:
test_df = pd.DataFrame(
    np.random.rand(6,6),
    columns = pd.MultiIndex.from_product([['a', 'b', 'c'], [1,2]])
)

test_df

          a                   b                   c
          1         2         1         2         1         2
0  0.923898  0.870892  0.957975  0.198712  0.154915  0.936550
1  0.055429  0.761642  0.758745  0.828740  0.171728  0.915313
2  0.757990  0.480396  0.444086  0.804703  0.675458  0.479114
3  0.282188  0.167667  0.621009  0.785411  0.548952  0.375335
4  0.800418  0.945215  0.454103  0.892792  0.321960  0.683211
5  0.775419  0.183102  0.657771  0.030854  0.191078  0.795698

If you are using `pandas.MultiIndex` in columns of `pandas.DataFrame` you have to use `tuple` as `col_name` argument.

In [8]:
insert_next(
    test_df, ("a", 1),
    np.random.rand(6)
)

          a a _transf         a         b                   c
          1 1 _transf         2         1         2         1         2
0  0.923898  0.932568  0.870892  0.957975  0.198712  0.154915  0.936550
1  0.055429  0.739121  0.761642  0.758745  0.828740  0.171728  0.915313
2  0.757990  0.819836  0.480396  0.444086  0.804703  0.675458  0.479114
3  0.282188  0.442911  0.167667  0.621009  0.785411  0.548952  0.375335
4  0.800418  0.388703  0.945215  0.454103  0.892792  0.321960  0.683211
5  0.775419  0.609194  0.183102  0.657771  0.030854  0.191078  0.795698

Other case you will have warning, and most likely error from `pandas`.

# `get_num_cond`

Get condition for selection from pandas.DataFrame numeric data types

In [9]:
test_df = pd.DataFrame({
    "num_var" : np.random.normal(3, 5, 200),
    "cut_var" : np.random.choice(['a', 'b'])
})

get_num_cond(test_df)

num_var     True
cut_var    False
dtype: bool

# `pd_OHE`

Conduct one hot encoding for pandas data frame with the result as pandas.DataFrame and columns in reading format.

In [104]:
test_df = pd.DataFrame({
        'my_col' : ['a', 'b', 'b', 'a', np.NaN],
        'my_col2': ['d', 'v', 't', 'g', 'q']
})

pd_OHE(df = test_df, sk_OHE_kwarg = {'drop':['a', 'v']})

   my_col{b}  my_col{nan}  my_col2{d}  my_col2{g}  my_col2{q}  my_col2{t}
0        0.0          0.0         1.0         0.0         0.0         0.0
1        1.0          0.0         0.0         0.0         0.0         0.0
2        1.0          0.0         0.0         0.0         0.0         1.0
3        0.0          0.0         0.0         1.0         0.0         0.0
4        0.0          1.0         0.0         0.0         1.0         0.0

The format of the output column names can be specified with the `col_names_format` argument. It's a format string with `col_name` and `cat` arguments:
- `col_name` - name of the input column;
- `cat` - catetory of column.

In [106]:
test_df = pd.DataFrame({
        'my_col' : ['a', 'b', 'b', 'a', np.NaN],
        'my_col2': ['d', 'v', 't', 'g', 'q']
})

pd_OHE(
    df = test_df, 
    sk_OHE_kwarg = {'drop':['a', 'v']},
    col_names_format = "{col_name}->{cat}"
)

   my_col->b  my_col->nan  my_col2->d  my_col2->g  my_col2->q  my_col2->t
0        0.0          0.0         1.0         0.0         0.0         0.0
1        1.0          0.0         0.0         0.0         0.0         0.0
2        1.0          0.0         0.0         0.0         0.0         1.0
3        0.0          0.0         0.0         1.0         0.0         0.0
4        0.0          1.0         0.0         0.0         1.0         0.0

# `get_merge_repl_rule`
Get an joining rule for the levels of some variable for further use in `pandas.Series.replace`

In [11]:
get_merge_repl_rule([['lev1', 'lev2'], ['lev3']])

{'lev1': 'lev1_lev2', 'lev2': 'lev1_lev2', 'lev3': 'lev3'}

In [12]:
get_merge_repl_rule([['lev1', 'lev2'], ['lev3']], "|")

{'lev1': 'lev1|lev2', 'lev2': 'lev1|lev2', 'lev3': 'lev3'}

# `np_replace`

For `numpy.array` replace values, by roole defined as dictionary:<br>
```
{
    <old val1>:<new val1>, 
    <old val2>:<new val2>,
    .....................
    <old valn>:<new valn>
}
```

`pandas.DataFrame.replace` synonym, but for `numpy.array`.

In [11]:
X = np.random.choice(
    ['a', 'b', 'c'], [10, 10]
)

X

array([['c', 'c', 'b', 'a', 'a', 'a', 'a', 'a', 'c', 'c'],
       ['a', 'c', 'b', 'b', 'b', 'b', 'a', 'c', 'a', 'b'],
       ['a', 'b', 'a', 'b', 'b', 'a', 'b', 'c', 'b', 'b'],
       ['c', 'a', 'c', 'a', 'a', 'b', 'b', 'c', 'a', 'c'],
       ['c', 'a', 'c', 'a', 'a', 'a', 'b', 'b', 'c', 'c'],
       ['a', 'c', 'c', 'b', 'a', 'b', 'b', 'a', 'b', 'b'],
       ['c', 'c', 'b', 'b', 'b', 'a', 'c', 'c', 'c', 'b'],
       ['b', 'b', 'b', 'a', 'c', 'b', 'c', 'b', 'b', 'c'],
       ['c', 'a', 'a', 'c', 'c', 'a', 'a', 'c', 'a', 'c'],
       ['a', 'c', 'a', 'b', 'a', 'b', 'a', 'c', 'a', 'a']], dtype='<U1')

In [12]:
np_replace(X, {'a':'test_a', 'b': "test_b", 'a':"test_a2"})

array([['c', 'c', 'test_b', 'test_a2', 'test_a2', 'test_a2', 'test_a2',
        'test_a2', 'c', 'c'],
       ['test_a2', 'c', 'test_b', 'test_b', 'test_b', 'test_b',
        'test_a2', 'c', 'test_a2', 'test_b'],
       ['test_a2', 'test_b', 'test_a2', 'test_b', 'test_b', 'test_a2',
        'test_b', 'c', 'test_b', 'test_b'],
       ['c', 'test_a2', 'c', 'test_a2', 'test_a2', 'test_b', 'test_b',
        'c', 'test_a2', 'c'],
       ['c', 'test_a2', 'c', 'test_a2', 'test_a2', 'test_a2', 'test_b',
        'test_b', 'c', 'c'],
       ['test_a2', 'c', 'c', 'test_b', 'test_a2', 'test_b', 'test_b',
        'test_a2', 'test_b', 'test_b'],
       ['c', 'c', 'test_b', 'test_b', 'test_b', 'test_a2', 'c', 'c', 'c',
        'test_b'],
       ['test_b', 'test_b', 'test_b', 'test_a2', 'c', 'test_b', 'c',
        'test_b', 'test_b', 'c'],
       ['c', 'test_a2', 'test_a2', 'c', 'c', 'test_a2', 'test_a2', 'c',
        'test_a2', 'c'],
       ['test_a2', 'c', 'test_a2', 'test_b', 'test_a2', 'test_b',
        'test_a2', 'c', 'test_a2', 'test_a2']], dtype='<U7')

# `fix_pd_multiIndex`

`padnas` has some problems with loading multilevel columns headers from excel. When different columns has different count of levels, result `pandas.DataFrame` will have maximum count of levels in each columns, and lower levels of columns wich in excel has less levels will renamed like `Unnamed: ...`. This function goal is change every name of wich starts from `Unnamed: ... ` in index to empty line in index.

Let the input file looks like.

<img src="pictures/multiindex_examle.png"></img>

By defult panads loads it like.

In [13]:
df = pd.read_excel(
    "test_data/fix_pd_multiIndex_df.xlsx",
    header = [0,1]
)
df

                  id group1      group2
  Unnamed: 0_level_1   col1 col2   col3 col4
0                323      a    4      g    5
1                433      b    5      r    6
2                123      c    6      d    7
3                321      d    7      x    5

So `id` column, loaded as `("id", "Unnamed: 0_level_1")`. Now lets apply function for geting a new Index.

In [14]:
new_columns = fix_pd_multiIndex(df.columns)
new_columns

MultiIndex([(    'id',     ''),
            ('group1', 'col1'),
            ('group1', 'col2'),
            ('group2', 'col3'),
            ('group2', 'col4')],
           )

And now apply it to our dataframe.

In [15]:
df.columns = new_columns
df

    id group1      group2
         col1 col2   col3 col4
0  323      a    4      g    5
1  433      b    5      r    6
2  123      c    6      d    7
3  321      d    7      x    5